[
  {
    "title": "The Federation of Worlds - Overview",
    "body": "# The Federation of Worlds\n\nFounded in 2287 after the First Contact Accord, the Federation of Worlds represents humanity's greatest achievement: peaceful cooperation across solar systems.\n\n## Member Worlds\n\n**Core Worlds:**\n- Earth (Sol III) - Original homeworld, now primarily an ecological preserve and cultural center\n- Mars Colony Prime - Industrial and agricultural hub\n- Europa Station - Scientific research center beneath the ice\n- Titan Settlement - Energy production and resource extraction\n\n**Outer Colonies:**\n- Alpha Centauri System - Three inhabited worlds\n- Tau Ceti Outpost - Frontier colony, known for independence\n- Proxima Station - Trading hub\n\n## Government\n\nThe Federation Council meets monthly via quantum-entangled communication. Each world sends representatives based on population. Decisions require a 60% supermajority.\n\n## Technology Level\n\nFaster-than-light travel achieved in 2401 via the Alcubierre-Yamamoto Drive. Travel between core worlds takes weeks; to outer colonies, months. Quantum communication is instantaneous but expensive.\n\n## Population\n\nTotal human population: ~47 billion across all worlds. Earth: 2 billion. Mars: 8 billion. Space stations and habitats: 5 billion. Outer colonies: 32 billion.",
    "lang": "en",
    "tags": ["lore", "federation", "government", "worlds"]
  },
  {
    "title": "The Andromedans - First Contact Species",
    "body": "# The Andromedans\n\n## First Contact\n\nIn 2283, humanity detected and successfully communicated with the Andromedans, a species from a neighboring galaxy (actually a mistranslation - they're from the Andromeda sector of our galaxy, ~2,500 light-years away).\n\n## Biology\n\nAndromedans are silicon-based lifeforms existing at much higher temperatures than humans. They perceive time differently due to faster neural processes - what's a minute to us is like an hour to them.\n\n## Society\n\nHighly collective intelligence. Individual Andromedans are semi-autonomous but share thoughts through electromagnetic resonance. They find human individualism both fascinating and inefficient.\n\n## Relations with Humanity\n\nThe Andromedans helped humanity refine FTL technology in exchange for cultural exchanges. They're obsessed with human art, music, and literature, finding our emotional expressions exotic and compelling.\n\n## Current Status\n\nAndromedan ambassador to the Federation resides on Mercury (comfortable temperature). Regular cultural exchanges continue. Trade agreements cover exotic materials and information.",
    "lang": "en",
    "tags": ["lore", "aliens", "andromedans", "first-contact"]
  },
  {
    "title": "History: The Mars Rebellion of 2311",
    "body": "# The Mars Rebellion (2311-2314)\n\n## Background\n\nBy 2310, Mars Colony had 5 billion residents but limited autonomy. Earth-based corporations controlled Martian resources. Growing frustration with \"taxation without representation\" echoed Earth's own history.\n\n## The Spark\n\nIn January 2311, Earth's Federation Council voted to increase mining quotas without consulting Martian representatives. Mars Colony Prime declared independence.\n\n## The Conflict\n\nLargely bloodless. Mars controlled its own infrastructure and life support. Earth couldn't afford a military campaign across interplanetary distances. Standoff lasted three years.\n\n## Resolution\n\nThe Treaty of Olympus Mons (2314) granted Mars full voting rights and resource sovereignty. This precedent established the modern Federation structure where all worlds have equal say.\n\n## Legacy\n\nMars Rebellion Day (March 15) is a Federation holiday celebrating self-determination. The conflict proved violence wasn't inevitable - negotiation and mutual respect could resolve even existential disputes.",
    "lang": "en",
    "tags": ["lore", "history", "mars", "rebellion", "independence"]
  }
]
